
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала"); 
	Если НЕ ЗначениеПараметра = Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		//ЗначениеПараметра.Значение = Дата(Формат(ЭтотОбъект.Год,"ЧГ=; ДЛФ=")+"01"+"01");  
		ЗначениеПараметра.Значение = НачалоГода(ЭтотОбъект.Год);
	КонецЕсли; 
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания"); 
	Если НЕ   ЗначениеПараметра = Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		//ЗначениеПараметра.Значение = КонецДня(Дата(Формат(ЭтотОбъект.Год,"ЧГ=; ДЛФ=")+"12"+"31"));  
		ЗначениеПараметра.Значение = КонецГода(ЭтотОбъект.Год); 

	КонецЕсли;
	
КонецПроцедуры
