#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда) 
	
	ЗадатьВопросПользователю();
	
КонецПроцедуры 


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//@skip-check function-should-return-value
&НаКлиенте
Асинх Функция ЗадатьВопросПользователю() 
	
	Обещание = ВопросАсинх("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Результат = Ждать Обещание;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()  
	
	Объект.Выплаты.Очистить();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
    ДанныеЗаполнения = ДокументОбъект.ЗаполнитьТЧ();  
	
	Для Каждого элДанные из ДанныеЗаполнения Цикл
		НоваяСтрока = Объект.Выплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, элДанные); 
		Модифицированность = Истина;
	КонецЦикла;

КонецПроцедуры 
#КонецОбласти

